tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "smudge/smudge"
tap "supabase/tap"
brew "antigen"
brew "bat"
brew "cmake"
brew "exa"
brew "fd"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "lazygit"
brew "lsd"
brew "neovim"
brew "nvm"
brew "pnpm"
brew "ripgrep"
brew "sqlite"
brew "stylua"
brew "tmux"
brew "ttfautohint"
brew "vercel-cli"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-imagemagick", "with-native-comp"]
brew "smudge/smudge/nightlight"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "alacritty"
cask "amethyst"
cask "arc"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "focus"
cask "kitty"
cask "postman"
cask "raycast"
cask "spotify"
cask "via"
cask "visual-studio-code"
cask "karabiner-elements"
